app/views/clients/export_client_details.xls.erb

SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 27]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 27]]
---
			<td><%= @client.mobile%></td>
			<td><%= @client.projects.size%></td>