app/views/clients/export.xls.erb

SELECT COUNT(*) FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 26]]
---
			<td><%= client.mobile%></td>
			<td><%= client.projects.size%></td>