app/views/clients/index.html.erb

SELECT COUNT(*) FROM "projects" WHERE "projects"."client_id" = ?  [["client_id", 1]]
---
<% @clients.each do |client|%>
	<%data[client.name] = client.projects.size %>