app/views/clients/show.html.erb

		<% count = 1 %>
			<% @client.projects.where('status = ?', "new").each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ? AND (status = 'new')  [["client_id", 3]]


				<% if !project.tasks.empty? %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]