app/views/projects/edit.html.erb

	<%=f.label :client_id%><br>
	<%=f.collection_select :client_id, Client.all, :id, :name, prompt: "Select Client" %><br>
---
SELECT "clients".* FROM "clients"


	<%=f.collection_check_boxes :category_ids, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"