app/views/projects/index.html.erb

<%
	data["new"] = current_user.projects.where('status = ?',"new").size
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  ORDER BY start_date DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = ? AND (status = 'new')  [["user_id", 1]]