app/views/projects/new.html.erb

SELECT "categories".* FROM "categories"
---

	<%=f.collection_check_boxes :category_ids, Category.all, :id, :name %>