app/views/projects/show.html.erb

 <ul>
 	<% @project.tasks.each do |task|%>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND (is_completed = 'f' AND due_date <= '2016-11-02')  [["project_id", 1]]