app/controllers/api/v1/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
			def show
				@client = current_user.clients.find(params[:id])