app/views/rooms/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = ?  [["room_id", 3]]
---
<ul>
<%@room.bookings.each do |booking|%>