app/controllers/bookings_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @booking = Booking.new
    @room = Room.find(params[:room_id])

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "bookings" ("start_date", "end_date", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["start_date", "2016-11-23"], ["end_date", "2016-11-24"], ["user_id", 1], ["room_id", 3], ["created_at", "2016-11-22 15:30:08.746593"], ["updated_at", "2016-11-22 15:30:08.746593"]]
---
  def create
    @booking = Booking.new(booking_params)
    @booking.user_id = current_user.id
    @booking.room_id = params[:room_id]
    @room = Room.find(params[:room_id])

    respond_to do |format|
      if @booking.save

SELECT "bookings".* FROM "bookings" WHERE (room_id = 1 AND end_date >= '2016-11-22')
---
    def set_booking
      @booking = Booking.find(params[:id])