app/controllers/clients_controller.rb

	def index
		@clients = current_user.clients #Client.where('user_id = ?',current_user.id) #Client.all
---
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ?  [["user_id", 2]]

	def create
		@client = Client.new(client_param)
		@client.user_id = current_user.id
		@client.gender = determine_gender(@client.name)
		if @client.save
---
INSERT INTO "clients" ("name", "mobile", "website", "company", "email", "user_id", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def show
		begin
		@client = current_user.clients.find(params[:id])
	rescue ActiveRecord::RecordNotFound
		redirect_to clients_path, notice: "Record not found"
	end
=begin
		@projects = Project.where('client_id = ?',@client.id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" = ? AND "clients"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]
SELECT "projects".* FROM "projects" WHERE "projects"."client_id" = ? AND (status = 'new')  [["client_id", 3]]

	def update
		@client = Client.find(params[:id])
		if @client.update_attributes(client_param)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "clients" SET "name" = ?, "website" = ?, "email" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "Rakesh.S"], ["website", "http://www.qubik.com"], ["email", "rakesh1@gmail.com"], ["updated_at", "2016-10-22 11:28:57.825811"], ["id", 1]]

	def destroy
		@client = Client.find(params[:id])
		@client.destroy
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]

	def export_client_details
		@client = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", nil]]