app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  ORDER BY start_date DESC  [["user_id", 1]]
---
	def index
		@projects = current_user.projects #.order('start_date DESC') #Project.order('start_date DESC')

INSERT INTO "projects" ("name", "client_id", "description", "status", "start_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@project = Project.new(project_param)
		@project.user_id = current_user.id
		if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "projects" SET "name" = ?, "status" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Zam"], ["status", "new"], ["updated_at", "2016-10-22 11:15:35.439898"], ["id", 6]]
---
	def update
		@project = Project.find(params[:id])
		if @project.update_attributes(project_param)