app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Room 1"], ["created_at", "2016-11-22 15:06:11.265957"], ["updated_at", "2016-11-22 15:06:11.265957"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save