app/controllers/sandbox_controller.rb

  def clients
  	@clients = Client.all
---
SELECT "clients".* FROM "clients"

  def projects
  	@projects = Project.where('start_date > ? AND start_date < ?', Date.today.beginning_of_month-3.months,Date.today.beginning_of_month).order('start_date')
---
SELECT "projects".* FROM "projects" WHERE (start_date > '2016-07-01' AND start_date < '2016-10-01')  ORDER BY start_date

  def products
=begin

    1. List all products based on a given category
    2. List products based on price range
    3. List products based on brand
    4. List products based on size of a certain brand falling within a given price range
    5. List products that are available
    6. List products following under price 499
    7. List products upto price 1200
    8. List all products based on the categories
    9. List only products which are available
    10. List products price descending and name ascending
    11. List products whose prices are the same as a group
    12. Display the total worth of the products
    13. Display total worth of products in each category
    14. List all products based on the categories


=end
	# 1
	@category = "Toys"
	@products_category = Product.where('category = ?', @category).limit(20)
---
SELECT  "products".* FROM "products" WHERE (size = 'XL' AND brand = 'Peter England' AND price >= 10 AND price <= 20) LIMIT 20


	#8
	@category_product_hash = {}
	@products = Product.all.limit(20)
	@products.each do |product|
---
SELECT  "products".* FROM "products"  ORDER BY price DESC, name LIMIT 20
SELECT  "products".* FROM "products" LIMIT 100



	#12
	@total_worth = Product.sum(:price)
---
SELECT SUM("products"."price") FROM "products"