app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "project_id", "is_complete", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "task again"], ["project_id", 1], ["is_complete", "t"], ["due_date", "2016-11-05"], ["created_at", "2016-11-02 14:37:09.318438"], ["updated_at", "2016-11-02 14:37:09.318438"]]
---
	def create
		@task = Task.new(task_params)
		if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "tasks" SET "is_complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_complete", "t"], ["updated_at", "2016-11-08 14:07:12.796817"], ["id", 3]]
---
		task = Task.find(params[:id])
		task.update_attributes(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "is_complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_complete", "t"], ["updated_at", "2016-11-08 13:47:51.981930"], ["id", 1]]
---
		task = Task.find(params[:task_id])
		task.update_attributes(is_complete:true)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "is_complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_complete", "f"], ["updated_at", "2016-11-08 13:56:05.098441"], ["id", 1]]
---
	def mark_as_incomplete
		@task = Task.find(params[:task_id])
		@task.update_attributes(is_complete:false)